### Cleaning a row dataset into useful & meaningful

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:

emp = pd.read_excel("D:\\Dataset\\EDA.xlsx")
emp

              Name           Domain        Age   Location   Salary       Exp
0             Mike  Data science*%$  34 Yearrs     Mmbail    5000$        2+
1          Teddy^^          Testing       56yr   Banglore   10%000        <3
2           Umar#r       Anal&&lyst        NaN        NaN  20000rs    4> yrs
3             jane       Statistics        NaN      delhi   30000+       NaN
4           Uttam*              NLP      64-yr       pune   45000/  5+ years
5              kim              NaN       55yr        NaN    10lpa       10+

In [3]:
emp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      6 non-null      object
 1   Domain    5 non-null      object
 2   Age       4 non-null      object
 3   Location  4 non-null      object
 4   Salary    6 non-null      object
 5   Exp       5 non-null      object
dtypes: object(6)
memory usage: 420.0+ bytes

In [4]:
emp.describe()

        Name           Domain        Age Location Salary Exp
count      6                5          4        4      6   5
unique     6                5          4        4      6   5
top     Mike  Data science*%$  34 Yearrs   Mmbail  5000$  2+
freq       1                1          1        1      1   1

In [5]:
emp.isnull().sum()

Name        0
Domain      1
Age         2
Location    2
Salary      0
Exp         1
dtype: int64

In [6]:
emp.isnull().sum().sum()

6

In [7]:
emp['Name']

0               Mike
1            Teddy^^
2             Umar#r
3               jane
4             Uttam*
5                kim
Name: Name, dtype: object

In [8]:
len(emp)

6

In [9]:
emp.columns

Index(['Name', 'Domain', 'Age', 'Location', 'Salary', 'Exp'], dtype='object')

In [10]:
len(emp.columns)

6

In [11]:
emp.shape

(6, 6)

In [12]:
emp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      6 non-null      object
 1   Domain    5 non-null      object
 2   Age       4 non-null      object
 3   Location  4 non-null      object
 4   Salary    6 non-null      object
 5   Exp       5 non-null      object
dtypes: object(6)
memory usage: 420.0+ bytes

In [13]:
emp

              Name           Domain        Age   Location   Salary       Exp
0             Mike  Data science*%$  34 Yearrs     Mmbail    5000$        2+
1          Teddy^^          Testing       56yr   Banglore   10%000        <3
2           Umar#r       Anal&&lyst        NaN        NaN  20000rs    4> yrs
3             jane       Statistics        NaN      delhi   30000+       NaN
4           Uttam*              NLP      64-yr       pune   45000/  5+ years
5              kim              NaN       55yr        NaN    10lpa       10+

In [14]:
emp['Name']

0               Mike
1            Teddy^^
2             Umar#r
3               jane
4             Uttam*
5                kim
Name: Name, dtype: object

In [15]:
emp['Domain']

0    Data science*%$
1            Testing
2         Anal&&lyst
3         Statistics
4                NLP
5                NaN
Name: Domain, dtype: object

In [16]:
emp['Age']

0    34 Yearrs
1         56yr
2          NaN
3          NaN
4        64-yr
5         55yr
Name: Age, dtype: object

In [17]:
emp['Salary']

0      5000$
1     10%000
2    20000rs
3     30000+
4     45000/
5      10lpa
Name: Salary, dtype: object

In [18]:
emp['Exp']

0          2+
1          <3
2      4> yrs
3         NaN
4    5+ years
5         10+
Name: Exp, dtype: object

# Data Cleansing

In [19]:
emp['Name']=emp['Name'].str.replace(r'\W','')

C:\Users\radhe\AppData\Local\Temp\ipykernel_17056\2684097443.py:1: FutureWarning: The default value of regex will change from True to False in a future version.
  emp['Name']=emp['Name'].str.replace(r'\W','')

In [20]:
emp['Name']

0     Mike
1    Teddy
2    Umarr
3     jane
4    Uttam
5      kim
Name: Name, dtype: object

In [21]:
emp[['Name','Domain','Exp']]

    Name           Domain       Exp
0   Mike  Data science*%$        2+
1  Teddy          Testing        <3
2  Umarr       Anal&&lyst    4> yrs
3   jane       Statistics       NaN
4  Uttam              NLP  5+ years
5    kim              NaN       10+

In [22]:
#emp['Name','Domain','Exp'] ---not working

In [23]:
emp

    Name           Domain        Age   Location   Salary       Exp
0   Mike  Data science*%$  34 Yearrs     Mmbail    5000$        2+
1  Teddy          Testing       56yr   Banglore   10%000        <3
2  Umarr       Anal&&lyst        NaN        NaN  20000rs    4> yrs
3   jane       Statistics        NaN      delhi   30000+       NaN
4  Uttam              NLP      64-yr       pune   45000/  5+ years
5    kim              NaN       55yr        NaN    10lpa       10+

In [24]:
#  reges(,^%#) are known as regex
emp['Name']=emp['Name'].str.replace(r'\W','')

C:\Users\radhe\AppData\Local\Temp\ipykernel_17056\2647626973.py:2: FutureWarning: The default value of regex will change from True to False in a future version.
  emp['Name']=emp['Name'].str.replace(r'\W','')

In [25]:
emp

    Name           Domain        Age   Location   Salary       Exp
0   Mike  Data science*%$  34 Yearrs     Mmbail    5000$        2+
1  Teddy          Testing       56yr   Banglore   10%000        <3
2  Umarr       Anal&&lyst        NaN        NaN  20000rs    4> yrs
3   jane       Statistics        NaN      delhi   30000+       NaN
4  Uttam              NLP      64-yr       pune   45000/  5+ years
5    kim              NaN       55yr        NaN    10lpa       10+

In [26]:
emp['Domain']=emp['Domain'].str.replace(r'\W','')

C:\Users\radhe\AppData\Local\Temp\ipykernel_17056\2553557837.py:1: FutureWarning: The default value of regex will change from True to False in a future version.
  emp['Domain']=emp['Domain'].str.replace(r'\W','')

In [27]:
emp['Domain']

0    Datascience
1        Testing
2       Anallyst
3     Statistics
4            NLP
5            NaN
Name: Domain, dtype: object

In [28]:
emp['Age']=emp['Age'].str.replace(r'\W','')

C:\Users\radhe\AppData\Local\Temp\ipykernel_17056\1258434123.py:1: FutureWarning: The default value of regex will change from True to False in a future version.
  emp['Age']=emp['Age'].str.replace(r'\W','')

In [29]:
emp['Age']
# only hyphen is removed

0    34Yearrs
1        56yr
2         NaN
3         NaN
4        64yr
5        55yr
Name: Age, dtype: object

In [30]:
emp['Age']=emp['Age'].str.extract('(\d+)')

In [31]:
emp['Age']

0     34
1     56
2    NaN
3    NaN
4     64
5     55
Name: Age, dtype: object

In [32]:
emp['Salary']=emp['Salary'].str.replace(r'\W','')

C:\Users\radhe\AppData\Local\Temp\ipykernel_17056\3154252769.py:1: FutureWarning: The default value of regex will change from True to False in a future version.
  emp['Salary']=emp['Salary'].str.replace(r'\W','')

In [33]:
emp['Salary']

0       5000
1      10000
2    20000rs
3      30000
4      45000
5      10lpa
Name: Salary, dtype: object

In [34]:
emp['Salary']=emp['Salary'].str.extract('(\d+)')

In [35]:
emp['Salary']

0     5000
1    10000
2    20000
3    30000
4    45000
5       10
Name: Salary, dtype: object

In [36]:
emp['Exp']

0          2+
1          <3
2      4> yrs
3         NaN
4    5+ years
5         10+
Name: Exp, dtype: object

In [37]:
emp['Exp']= emp['Exp'].str.extract('(\d+)')

In [38]:
emp['Exp']

0      2
1      3
2      4
3    NaN
4      5
5     10
Name: Exp, dtype: object

In [39]:
emp['Exp']=emp['Exp'].str.replace(r'\W','')

C:\Users\radhe\AppData\Local\Temp\ipykernel_17056\1973699693.py:1: FutureWarning: The default value of regex will change from True to False in a future version.
  emp['Exp']=emp['Exp'].str.replace(r'\W','')

In [40]:
emp['Exp']

0      2
1      3
2      4
3    NaN
4      5
5     10
Name: Exp, dtype: object

In [41]:
# here converted row dataset into meaningful
emp

    Name       Domain  Age   Location Salary  Exp
0   Mike  Datascience   34     Mmbail   5000    2
1  Teddy      Testing   56   Banglore  10000    3
2  Umarr     Anallyst  NaN        NaN  20000    4
3   jane   Statistics  NaN      delhi  30000  NaN
4  Uttam          NLP   64       pune  45000    5
5    kim          NaN   55        NaN     10   10